<template>
  <div class="play">
    <aplayer
      autoplay
      showlrc
      :music="{
  title: '来自尘埃的光（《全职高手》电视剧片头曲）',
  author: '蔡维泽',
  url: 'http://ws.stream.qqmusic.qq.com/C4000026068q3oJjXe.m4a?guid=3769923923&vkey=780D0B91B6488DBD5CA0AFDA39019364F0B3398554851F72A21C2DF51C6C3339B62A53CD4F9ADE146458DC632CF2A3A0E7B69F211BC773F2&uin=1971&fromtag=66',
  pic: 'https://y.gtimg.cn/music/photo_new/T002R300x300M000001ybzgu1cVjIO.jpg?max_age=2592000',
  lrc: '[00:00.00]来自尘埃的光 - 蔡维泽\n[00:01.36]词：青修\n[00:01.49]曲：阿鲲\n[00:01.63]制作人：阿鲲\n[00:01.83]和声编写：阿鲲/许一鸣/赵一一\n[00:02.32]和声：许一鸣/赵一一\n[00:02.64]录音混音：周晓明\n[00:02.91]配唱指导：阿鲲\n[00:03.14]录音混音棚：XM Studio\n[00:03.46]音乐制作：柠萌悦心\n[00:03.76]音乐发行：哇唧唧哇娱乐\n[00:04.13]生于微末中的万千萤火\n[00:07.61]乘长风汇聚成熠熠星河\n[00:11.39]在云巅之上向世界宣告\n[00:15.31]我们将重回荣耀\n[00:21.23]拨开云层落下炽热\n[00:25.00]消融冰雪闯过波折\n[00:28.64]终于在巅峰的这一刻\n[00:32.52]有身影与过去身影重合\n[00:36.42]过去未曾来的荣耀\n[00:40.36]未来过不去的骄傲\n[00:44.02]在你我指尖交错凝结成\n[00:48.10]点燃战场的战歌\n[00:51.61]漫漫长夜里唯一的亮色\n[00:55.57]是平庸中走过来的你和我\n[00:59.39]是在云端上 是在尘埃中\n[01:03.32]拼尽全力盛放的萤火\n[01:07.13]我来自传说去续写传说\n[01:10.83]一朝汹涌不枉十年执着\n[01:14.73]这一战要让所有人记得\n[01:18.63]我们加冕荣耀的时刻\n[01:24.51]拨开云层落下炽热\n[01:28.33]消融冰雪闯过波折\n[01:31.83]终于在巅峰的这一刻\n[01:35.83]有身影与过去身影重合\n[01:39.85]过去未曾来的荣耀\n[01:43.78]未来过不去的骄傲\n[01:47.31]在你我指尖交错凝结成\n[01:51.45]点燃战场的战歌\n[01:55.04]漫漫长夜里唯一的亮色\n[01:58.95]是平庸中走过来的你和我\n[02:02.72]是在云端上 是在尘埃中\n[02:06.60]拼尽全力盛放的萤火\n[02:10.42]我来自传说去续写传说\n[02:14.22]一朝汹涌不枉十年执着\n[02:18.11]这一战要让所有人记得\n[02:21.93]我们加冕荣耀的时刻\n[02:41.21]漫漫长夜里唯一的亮色\n[02:45.11]是平庸中走过来的你和我\n[02:48.79]是在云端上 是在尘埃中\n[02:52.69]拼尽全力盛放的萤火\n[02:56.51]拼尽全力盛放的萤火'
}"
    ></aplayer>
  </div>
</template>

<script>
import Aplayer from 'vue-aplayer'
export default {
  components: {
    Aplayer
  }
}
</script>

<style lang="scss" scoped>
.play {
  margin-left: 20px;
  width: 1000px;
  height: 100px;
  margin: 0 auto 30px;
}
.aplayer {
  background: rgba(255, 255, 255, 1);
  color: #000;
}
</style>
